RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/src/ht32f1xxxx_gpio.c
/*********************************************************************************************************//**
 * @file    ht32f1xxxx_gpio.c
 * @version $Rev:: 2797         $
 * @date    $Date:: 2022-11-28 #$
 * @brief   This file provides all the GPIO and AFIO firmware functions.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f1xxxx_gpio.h"

/** @addtogroup HT32F1xxxx_Peripheral_Driver HT32F1xxxx Peripheral Driver
  * @{
  */

/** @defgroup GPIO GPIO
  * @brief GPIO driver modules
  * @{
  */


/* Private function prototypes -----------------------------------------------------------------------------*/
u32 _GPIO_ClockControl(HT_GPIO_TypeDef* HT_GPIOx, ControlStatus Cmd);
u32 _AFIO_ClockControl(ControlStatus Cmd);

/* Private macro -------------------------------------------------------------------------------------------*/
/** @defgroup GPIO_Private_Macro GPIO private macros
  * @{
  */
#if (AUTO_CK_CONTROL == 1)
  #define GPIO_CK_ST       u32 isAlreadyOn
  #define GPIO_CK_ON()     (isAlreadyOn = _GPIO_ClockControl(HT_GPIOx, ENABLE))
  #define GPIO_CK_OFF()    if (isAlreadyOn == FALSE) _GPIO_ClockControl(HT_GPIOx, DISABLE)
  #define AFIO_CK_ST       u32 isAlreadyOn
  #define AFIO_CK_ON()     (isAlreadyOn = _AFIO_ClockControl(ENABLE))
  #define AFIO_CK_OFF()    if (isAlreadyOn == FALSE) _AFIO_ClockControl(DISABLE)
#else
  #define GPIO_CK_ST
  #define GPIO_CK_ON(...)
  #define GPIO_CK_OFF(...)
  #define AFIO_CK_ST
  #define AFIO_CK_ON(...)
  #define AFIO_CK_OFF(...)
#endif
/**
  * @}
  */

/* Global functions ----------------------------------------------------------------------------------------*/
/** @addtogroup GPIO_Exported_Functions GPIO exported functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Deinitializes the GPIO peripheral registers to their default reset values.
 * @param HT_GPIOx: where HT_GPIOx is the selected GPIO from the GPIO peripherals.
 * @retval None
 ************************************************************************************************************/
void GPIO_DeInit(HT_GPIO_TypeDef* HT_GPIOx)
{
  RSTCU_PeripReset_TypeDef RSTCUReset = {{0}};

  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPIO(HT_GPIOx));

  if (HT_GPIOx == HT_GPIOA)
  {
    RSTCUReset.Bit.PA = 1;
  }
  else if (HT_GPIOx == HT_GPIOB)
  {
    RSTCUReset.Bit.PB = 1;
  }
  else if (HT_GPIOx == HT_GPIOC)
  {
    RSTCUReset.Bit.PC = 1;
  }
  else if (HT_GPIOx == HT_GPIOD)
  {
    RSTCUReset.Bit.PD = 1;
  }
  #if (LIBCFG_GPIOE)
  else if (HT_GPIOx == HT_GPIOE)
  {
    RSTCUReset.Bit.PE = 1;
  }
  #endif
  #if (LIBCFG_GPIOF)
  else if (HT_GPIOx == HT_GPIOF)
  {
    RSTCUReset.Bit.PF = 1;
  }
  #endif

  RSTCU_PeripReset(RSTCUReset, ENABLE);
}

/*********************************************************************************************************//**
 * @brief Configure the direction of specified GPIO pins.
 * @param HT_GPIOx: where HT_GPIOx is the selected GPIO from the GPIO peripherals.
 * @param GPIO_PIN_nBITMAP: The port pins.
 *   This parameter can be any combination of GPIO_PIN_x.
 * @param GPIO_DIR_INorOUT:
 *   This parameter can be one of below:
 *     @arg GPIO_DIR_IN  : The pins are input mode
 *     @arg GPIO_DIR_OUT : The pins are output mode
 * @retval None
 ************************************************************************************************************/
void GPIO_DirectionConfig(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_nBITMAP, GPIO_DIR_Enum GPIO_DIR_INorOUT)
{
  GPIO_CK_ST;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPIO(HT_GPIOx));
  Assert_Param(IS_GPIO_DIR(GPIO_DIR_INorOUT));

  GPIO_CK_ON();

  if (GPIO_DIR_INorOUT != GPIO_DIR_IN)
    HT_GPIOx->DIRCR |= GPIO_PIN_nBITMAP;
  else
    HT_GPIOx->DIRCR &= ~GPIO_PIN_nBITMAP;

  GPIO_CK_OFF();
}

/*********************************************************************************************************//**
 * @brief Configure the pull resistor of specified GPIO pins.
 * @param HT_GPIOx: where HT_GPIOx is the selected GPIO from the GPIO peripherals.
 * @param GPIO_PIN_nBITMAP: The port pins.
 *   This parameter can be any combination of GPIO_PIN_x.
 * @param GPIO_PR_x: Selection of Pull resistor.
 *   This parameter can be one of below:
 *     @arg GPIO_PR_UP      : The pins with internal pull-up resistor
 *     @arg GPIO_PR_DOWN    : The pins with internal pull-down resistor
 *     @arg GPIO_PR_DISABLE : The pins without pull resistor
 * @retval None
 ************************************************************************************************************/
void GPIO_PullResistorConfig(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_nBITMAP, GPIO_PR_Enum GPIO_PR_x)
{
  u32 temp_up, temp_down;
  GPIO_CK_ST;

