RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/src/ht32f1xxxx_gpio.c
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPIO(HT_GPIOx));

  GPIO_CK_ON();
  if ((HT_GPIOx->LOCKR & GPIO_PIN_n) == 0)
    result = FALSE;
  else
    result = TRUE;
  GPIO_CK_OFF();
  return result;
}

/*********************************************************************************************************//**
 * @brief  Disable DEBUG port to prevent unexpected security lock.
 * @retval None
 ************************************************************************************************************/
void GPIO_DisableDebugPort(void)
{
  CKCU_PeripClockConfig_TypeDef CKCUClock = {{ 0 }};
  CKCUClock.Bit.PA         = 1;
  CKCUClock.Bit.AFIO       = 1;
  CKCU_PeripClockConfig(CKCUClock, ENABLE);

  AFIO_GPxConfig(GPIO_PA, GPIO_PIN_13, AFIO_FUN_GPIO);
  GPIO_PullResistorConfig(HT_GPIOA, GPIO_PIN_13, GPIO_PR_DOWN);
  GPIO_InputConfig(HT_GPIOA, GPIO_PIN_13, DISABLE);

  #if 0
  GPIO_PullResistorConfig(HT_GPIOA, GPIO_PIN_12, GPIO_PR_DOWN);
  GPIO_PullResistorConfig(HT_GPIOA, GPIO_PIN_12, GPIO_PR_UP);
  GPIO_PullResistorConfig(HT_GPIOA, GPIO_PIN_12, GPIO_PR_DOWN);
  GPIO_PullResistorConfig(HT_GPIOA, GPIO_PIN_12, GPIO_PR_UP);
  GPIO_PullResistorConfig(HT_GPIOA, GPIO_PIN_12, GPIO_PR_DOWN);
  GPIO_PullResistorConfig(HT_GPIOA, GPIO_PIN_12, GPIO_PR_UP);
  GPIO_PullResistorConfig(HT_GPIOA, GPIO_PIN_12, GPIO_PR_DOWN);
  GPIO_PullResistorConfig(HT_GPIOA, GPIO_PIN_12, GPIO_PR_UP);
  AFIO_GPxConfig(GPIO_PA, GPIO_PIN_12, AFIO_FUN_GPIO);
  #endif
}

/*********************************************************************************************************//**
 * @brief Convert HT_GPIOx to GPIO_Px
 * @param HT_GPIOx: where HT_GPIOx is the selected GPIO from the GPIO peripherals.
 * @retval GPIO_Px: GPIO ID
 ************************************************************************************************************/
u32 GPIO_GetID(HT_GPIO_TypeDef* HT_GPIOx)
{
  // Convert 0x400B0000 ~ 0x400C6000 to 0 ~ 11
  u32 GPIO_Px = (((u32)HT_GPIOx) >> (12 + 1)) & 0x7F;
  GPIO_Px -= 0x58;  // 0xB0000 >> 13 = 0x58

  return GPIO_Px;
}

/*********************************************************************************************************//**
 * @brief Deinitialize the AFIO peripheral registers to their default reset values.
 * @retval None
 ************************************************************************************************************/
void AFIO_DeInit(void)
{
  RSTCU_PeripReset_TypeDef RSTCUReset = {{0}};

  RSTCUReset.Bit.AFIO = 1;
  RSTCU_PeripReset(RSTCUReset, ENABLE);
}

/*********************************************************************************************************//**
 * @brief Configure alternated mode of GPIO with specified pins.
 * @param GPIO_Px: GPIO_PA ~ GPIO_PE.
 * @param AFIO_PIN_n: This parameter can be any combination of AFIO_PIN_x.
 * @param AFIO_MODE_n: This parameter can be one of the following values:
 *        @arg AFIO_MODE_DEFAULT : The default I/O function
 *        @arg AFIO_MODE_1       : Alternated mode 1
 *        @arg AFIO_MODE_2       : Alternated mode 2
 *        @arg AFIO_MODE_3       : Alternated mode 3
 *        @arg AFIO_MODE_4       : Alternated mode 4
 *        @arg AFIO_MODE_5       : Alternated mode 5
 *        @arg AFIO_MODE_6       : Alternated mode 6
 *        @arg AFIO_MODE_7       : Alternated mode 7
 *        @arg AFIO_MODE_8       : Alternated mode 8
 *        @arg AFIO_MODE_9       : Alternated mode 9
 *        @arg AFIO_MODE_10      : Alternated mode 10
 *        @arg AFIO_MODE_11      : Alternated mode 11
 *        @arg AFIO_MODE_12      : Alternated mode 12
 *        @arg AFIO_MODE_13      : Alternated mode 13
 *        @arg AFIO_MODE_14      : Alternated mode 14
 *        @arg AFIO_MODE_15      : Alternated mode 15
 * @retval None
 ************************************************************************************************************/
void AFIO_GPxConfig(u32 GPIO_Px, u32 AFIO_PIN_n, AFIO_MODE_Enum AFIO_MODE_n)
{
  vu32* pGPxCFGR = ((vu32*)&HT_AFIO->GPACFGR[0]) + GPIO_Px * 2;
  u32 index = 0;
  u32 Mask = 0, PinMode = 0;
  s32 i;
  AFIO_CK_ST;

  Assert_Param(IS_AFIO_MODE(AFIO_MODE_n));
  AFIO_CK_ON();

  for (i = 0; i <= 8; i += 8)
  {
    Mask = 0;
    PinMode = 0;
    if (AFIO_PIN_n & (0x00FF << i))
    {
      for (index = 0; index < 8; index++)
      {
        if ((AFIO_PIN_n >> index) & (0x0001 << i))
        {
          Mask |= (0xF << (index * 4));
          PinMode |= (AFIO_MODE_n << (index * 4));
        }
      }
      *pGPxCFGR = (*pGPxCFGR & (~Mask)) | PinMode;
    }
    pGPxCFGR++;
  }

  AFIO_CK_OFF();
}

/*********************************************************************************************************//**
 * @brief Select the GPIO pin to be used as EXTI channel.
 * @param GPIO_PIN_NUM_n: Specify the GPIO pin number to be configured.
 * @param GPIO_Px: GPIO_PA ~ GPIO_PF.
 * @retval None
 ************************************************************************************************************/
void AFIO_EXTISourceConfig(u32 GPIO_PIN_NUM_n, u32 GPIO_Px)
{
  u8 index = 0;
  u32 tmp = 0;
  AFIO_CK_ST;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPIO_PORT(GPIO_Px));
  Assert_Param(IS_GPIO_PIN_NUM(GPIO_PIN_NUM_n));

  AFIO_CK_ON();

  if (GPIO_PIN_NUM_n > 7)
  {
    index = 1;
    GPIO_PIN_NUM_n -= 8;
  }

  tmp = HT_AFIO->ESSR[index];
  tmp &= ~((u32)0x0F << (GPIO_PIN_NUM_n * 4));
  tmp |= (u32)GPIO_Px << (GPIO_PIN_NUM_n * 4);
  HT_AFIO->ESSR[index] = tmp;
  AFIO_CK_OFF();
}
/**
  * @}
  */

/* Private functions ---------------------------------------------------------------------------------------*/
/** @defgroup GPIO_Private_Functions GPIO private functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Turn on/Turn off specify GPIO clock.
 * @param HT_GPIOx: where HT_GPIOx is the selected GPIO from the GPIO peripherals.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval TRUE or FALSE (TRUE: already turn on, FALSE, Turn on by this call)
 ***********************************************************************************************************/
u32 _GPIO_ClockControl(HT_GPIO_TypeDef* HT_GPIOx, ControlStatus Cmd)
{
  u32 PxENStatus;
  /*--------------------------------------------------------------------------------------------------------*/
  /* ((0x400Bx000 & 0x0000F000) >> 12 ) / 2 + 16 =                                                          */
  /*  (0x0 ~ 0x4) + 16 = 16 ~ 20 for AHBCCR PAEN ~ PEEN bit offset                                          */
  /*--------------------------------------------------------------------------------------------------------*/
  u32 offset = ((((u32)HT_GPIOx) & 0x0000F000) >> 12) / 2 + 16;

  PxENStatus = HT_CKCU->AHBCCR & (1 << offset);

  if (PxENStatus != 0)
  {
    if (Cmd == DISABLE)
    {
      HT_CKCU->AHBCCR &= (~(1 << offset));
    }
    return TRUE;
  }

  HT_CKCU->AHBCCR |= (1 << offset);
  return FALSE;
}

/*********************************************************************************************************//**
 * @brief Turn on/Turn off AFIO clock.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval TRUE or FALSE (TRUE: already turn on, FALSE, Turn on by this call)
 ***********************************************************************************************************/
u32 _AFIO_ClockControl(ControlStatus Cmd)
{
  u32 AFIOENStatus;

  AFIOENStatus = HT_CKCU->APBCCR0 & (1 << 14);

  if (AFIOENStatus != 0)
  {
    if (Cmd == DISABLE)
    {
      HT_CKCU->APBCCR0 &= (~(1 << 14));
    }
    return TRUE;
  }

  HT_CKCU->APBCCR0 |= (1 << 14);
  return FALSE;
}
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
